esp8266/Arduino/hardware/arduino/sam/system/CMSIS/Device/ATMEL/sam3xa/svd/SAM3X8C.svd
        <register>
          <name>MSR4</name>
          <description>Mailbox Status Register (MB = 4)</description>
          <addressOffset>0x00000290</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MTIMESTAMP</name>
              <description>Timer value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MDLC</name>
              <description>Mailbox Data Length Code</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MRTR</name>
              <description>Mailbox Remote Transmission Request</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MABT</name>
              <description>Mailbox Message Abort</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MRDY</name>
              <description>Mailbox Ready</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MMI</name>
              <description>Mailbox Message Ignored</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDL4</name>
          <description>Mailbox Data Low Register (MB = 4)</description>
          <addressOffset>0x00000294</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDL</name>
              <description>Message Data Low Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDH4</name>
          <description>Mailbox Data High Register (MB = 4)</description>
          <addressOffset>0x00000298</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDH</name>
              <description>Message Data High Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR4</name>
          <description>Mailbox Control Register (MB = 4)</description>
          <addressOffset>0x0000029C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>MDLC</name>
              <description>Mailbox Data Length Code</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MRTR</name>
              <description>Mailbox Remote Transmission Request</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MACR</name>
              <description>Abort Request for Mailbox x</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MTCR</name>
              <description>Mailbox Transfer Command</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MMR5</name>
          <description>Mailbox Mode Register (MB = 5)</description>
          <addressOffset>0x000002A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MTIMEMARK</name>
              <description>Mailbox Timemark</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIOR</name>
              <description>Mailbox Priority</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOT</name>
              <description>Mailbox Object Type</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MB_DISABLED</name>
                  <description>Mailbox is disabled. This prevents receiving or transmitting any messages with this mailbox.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MB_RX</name>
                  <description>Reception Mailbox. Mailbox is configured for reception. If a message is received while the mailbox data register is full, it is discarded.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MB_RX_OVERWRITE</name>
                  <description>Reception mailbox with overwrite. Mailbox is configured for reception. If a message is received while the mailbox is full, it overwrites the previous message.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MB_TX</name>
                  <description>Transmit mailbox. Mailbox is configured for transmission.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MB_CONSUMER</name>
                  <description>Consumer Mailbox. Mailbox is configured in reception but behaves as a Transmit Mailbox, i.e., it sends a remote frame and waits for an answer.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MB_PRODUCER</name>
                  <description>Producer Mailbox. Mailbox is configured in transmission but also behaves like a reception mailbox, i.e., it waits to receive a Remote Frame before sending its contents.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MAM5</name>
          <description>Mailbox Acceptance Mask Register (MB = 5)</description>
          <addressOffset>0x000002A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MIDvB</name>
              <description>Complementary bits for identifier in extended frame mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIDvA</name>
              <description>Identifier for standard frame mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIDE</name>
              <description>Identifier Version</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MID5</name>
          <description>Mailbox ID Register (MB = 5)</description>
          <addressOffset>0x000002A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MIDvB</name>
              <description>Complementary bits for identifier in extended frame mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIDvA</name>
              <description>Identifier for standard frame mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIDE</name>
              <description>Identifier Version</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MFID5</name>
          <description>Mailbox Family ID Register (MB = 5)</description>
          <addressOffset>0x000002AC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MFID</name>
              <description>Family ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSR5</name>
          <description>Mailbox Status Register (MB = 5)</description>
          <addressOffset>0x000002B0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MTIMESTAMP</name>
              <description>Timer value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MDLC</name>
              <description>Mailbox Data Length Code</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MRTR</name>
              <description>Mailbox Remote Transmission Request</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MABT</name>
              <description>Mailbox Message Abort</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MRDY</name>
              <description>Mailbox Ready</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MMI</name>
              <description>Mailbox Message Ignored</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDL5</name>
          <description>Mailbox Data Low Register (MB = 5)</description>
          <addressOffset>0x000002B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDL</name>
              <description>Message Data Low Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDH5</name>
          <description>Mailbox Data High Register (MB = 5)</description>
          <addressOffset>0x000002B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDH</name>
              <description>Message Data High Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR5</name>
          <description>Mailbox Control Register (MB = 5)</description>
          <addressOffset>0x000002BC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>MDLC</name>
              <description>Mailbox Data Length Code</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MRTR</name>
              <description>Mailbox Remote Transmission Request</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MACR</name>
              <description>Abort Request for Mailbox x</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MTCR</name>
              <description>Mailbox Transfer Command</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MMR6</name>
          <description>Mailbox Mode Register (MB = 6)</description>
          <addressOffset>0x000002C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MTIMEMARK</name>
              <description>Mailbox Timemark</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIOR</name>
              <description>Mailbox Priority</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOT</name>
              <description>Mailbox Object Type</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MB_DISABLED</name>
                  <description>Mailbox is disabled. This prevents receiving or transmitting any messages with this mailbox.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MB_RX</name>
                  <description>Reception Mailbox. Mailbox is configured for reception. If a message is received while the mailbox data register is full, it is discarded.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MB_RX_OVERWRITE</name>
                  <description>Reception mailbox with overwrite. Mailbox is configured for reception. If a message is received while the mailbox is full, it overwrites the previous message.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MB_TX</name>
                  <description>Transmit mailbox. Mailbox is configured for transmission.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MB_CONSUMER</name>
                  <description>Consumer Mailbox. Mailbox is configured in reception but behaves as a Transmit Mailbox, i.e., it sends a remote frame and waits for an answer.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MB_PRODUCER</name>
                  <description>Producer Mailbox. Mailbox is configured in transmission but also behaves like a reception mailbox, i.e., it waits to receive a Remote Frame before sending its contents.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MAM6</name>
          <description>Mailbox Acceptance Mask Register (MB = 6)</description>
          <addressOffset>0x000002C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MIDvB</name>
              <description>Complementary bits for identifier in extended frame mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIDvA</name>
              <description>Identifier for standard frame mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIDE</name>
              <description>Identifier Version</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MID6</name>
          <description>Mailbox ID Register (MB = 6)</description>
          <addressOffset>0x000002C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MIDvB</name>
              <description>Complementary bits for identifier in extended frame mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIDvA</name>
              <description>Identifier for standard frame mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIDE</name>
              <description>Identifier Version</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MFID6</name>
          <description>Mailbox Family ID Register (MB = 6)</description>
          <addressOffset>0x000002CC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MFID</name>
              <description>Family ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSR6</name>
          <description>Mailbox Status Register (MB = 6)</description>
          <addressOffset>0x000002D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MTIMESTAMP</name>
              <description>Timer value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MDLC</name>
              <description>Mailbox Data Length Code</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MRTR</name>
              <description>Mailbox Remote Transmission Request</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MABT</name>
              <description>Mailbox Message Abort</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MRDY</name>
              <description>Mailbox Ready</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MMI</name>
              <description>Mailbox Message Ignored</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDL6</name>
          <description>Mailbox Data Low Register (MB = 6)</description>
          <addressOffset>0x000002D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDL</name>
              <description>Message Data Low Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDH6</name>
          <description>Mailbox Data High Register (MB = 6)</description>
          <addressOffset>0x000002D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDH</name>
              <description>Message Data High Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
